app/controllers/api/v1/positions_controller.rb

  def index
    positions = Position.limit(@limit).offset(@offset)
---
SELECT  "positions".* FROM "positions" LIMIT 15 OFFSET 0